### Report for project: `terraform`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.api.module.efs_data_volume.aws_efs_file_system.default[0] has changed
  ~ resource "aws_efs_file_system" "default" {
        id                              = "fs-0b22d749517d906e0"
      ~ size_in_bytes                   = [
          ~ {
              ~ value             = 1612296192 -> 2442846208
              ~ value_in_standard = 1612296192 -> 2442846208
                # (1 unchanged element hidden)
            },
        ]
        tags                            = {
            "Name"      = "gost-prod-gost-prod-datavolume"
            "Namespace" = "gost-prod"
        }
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ecs_cluster.default[0] will be updated in-place
  ~ resource "aws_ecs_cluster" "default" {
        id                 = "arn:aws:ecs:us-west-2:729134339726:cluster/gost-prod"
        name               = "gost-prod"
        tags               = {}
      ~ tags_all           = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ssm_parameter.deploy_api_cluster_name will be updated in-place
  ~ resource "aws_ssm_parameter" "deploy_api_cluster_name" {
        id          = "/gost/prod/deploy-config/api/cluster-name"
        name        = "/gost/prod/deploy-config/api/cluster-name"
        tags        = {}
      ~ tags_all    = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.deploy_api_service_name will be updated in-place
  ~ resource "aws_ssm_parameter" "deploy_api_service_name" {
        id          = "/gost/prod/deploy-config/api/service-name"
        name        = "/gost/prod/deploy-config/api/service-name"
        tags        = {}
      ~ tags_all    = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.deploy_website_cloudfront_distribution_id will be updated in-place
  ~ resource "aws_ssm_parameter" "deploy_website_cloudfront_distribution_id" {
        id          = "/gost/prod/deploy-config/website/distribution-id"
        name        = "/gost/prod/deploy-config/website/distribution-id"
        tags        = {}
      ~ tags_all    = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.deploy_website_s3_uri will be updated in-place
  ~ resource "aws_ssm_parameter" "deploy_website_s3_uri" {
        id          = "/gost/prod/deploy-config/website/s3-uri"
        name        = "/gost/prod/deploy-config/website/s3-uri"
        tags        = {}
      ~ tags_all    = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (7 unchanged attributes hidden)
    }

  # module.api.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
+       account_id = (known after apply)
+       arn        = (known after apply)
+       id         = (known after apply)
+       user_id    = (known after apply)
    }

  # module.api.data.aws_ecs_cluster.default[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_cluster" "default" {
+       arn                                  = (known after apply)
+       cluster_name                         = "gost-prod"
+       id                                   = (known after apply)
+       pending_tasks_count                  = (known after apply)
+       registered_container_instances_count = (known after apply)
+       running_tasks_count                  = (known after apply)
+       service_connect_defaults             = (known after apply)
+       setting                              = (known after apply)
+       status                               = (known after apply)
+       tags                                 = (known after apply)
    }

  # module.api.data.aws_kms_key.ssm will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_kms_key" "ssm" {
+       arn                        = (known after apply)
+       aws_account_id             = (known after apply)
+       creation_date              = (known after apply)
+       customer_master_key_spec   = (known after apply)
+       deletion_date              = (known after apply)
+       description                = (known after apply)
+       enabled                    = (known after apply)
+       expiration_model           = (known after apply)
+       id                         = (known after apply)
+       key_id                     = "alias/aws/ssm"
+       key_manager                = (known after apply)
+       key_state                  = (known after apply)
+       key_usage                  = (known after apply)
+       multi_region               = (known after apply)
+       multi_region_configuration = (known after apply)
+       origin                     = (known after apply)
+       valid_to                   = (known after apply)
    }

  # module.api.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
+       dns_suffix         = (known after apply)
+       id                 = (known after apply)
+       partition          = (known after apply)
+       reverse_dns_prefix = (known after apply)
    }

  # module.api.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
+       description = (known after apply)
+       endpoint    = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
    }

  # module.api.data.aws_ses_domain_identity.notifications will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ses_domain_identity" "notifications" {
+       arn                = (known after apply)
+       domain             = "grants.usdigitalresponse.org"
+       id                 = (known after apply)
+       verification_token = (known after apply)
    }

  # module.api.data.aws_ssm_parameter.datadog_api_key[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "datadog_api_key" {
+       arn     = (known after apply)
+       id      = (known after apply)
+       name    = "/gost/prod/datadog/api_key"
+       type    = (known after apply)
+       value   = (sensitive value)
+       version = (known after apply)
    }

  # module.api.aws_cloudwatch_log_group.default[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "default" {
        id                = "gost-prod-api-20230303023921715300000008"
        name              = "gost-prod-api-20230303023921715300000008"
        tags              = {}
      ~ tags_all          = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (4 unchanged attributes hidden)
    }

  # module.api.aws_ecs_service.default[0] will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:729134339726:service/gost-prod/gost-prod-api"
        name                               = "gost-prod-api"
        tags                               = {}
      ~ tags_all                           = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
      ~ task_definition                    = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api:4" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_ecs_task_definition.default[0] must be replaced
+/- resource "aws_ecs_task_definition" "default" {
      ~ arn                      = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api:4" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
-               {
-                   cpu                    = 0
-                   environment            = [
-                       {
-                           name  = "API_DOMAIN"
-                           value = "https://api.grants.usdigitalresponse.org"
                        },
-                       {
-                           name  = "AUDIT_REPORT_BUCKET"
-                           value = "gost-prod-arpaauditreports-729134339726-us-west-2-api"
                        },
-                       {
-                           name  = "DATA_DIR"
-                           value = "/var/data"
                        },
-                       {
-                           name  = "ENABLE_GRANTS_DIGEST"
-                           value = "true"
                        },
-                       {
-                           name  = "ENABLE_GRANTS_SCRAPER"
-                           value = "false"
                        },
-                       {
-                           name  = "GRANTS_SCRAPER_DATE_RANGE"
-                           value = "7"
                        },
-                       {
-                           name  = "GRANTS_SCRAPER_DELAY"
-                           value = "1000"
                        },
-                       {
-                           name  = "NODE_OPTIONS"
-                           value = "--max_old_space_size=1024"
                        },
-                       {
-                           name  = "NOTIFICATIONS_EMAIL"
-                           value = "grants-notifications@grants.usdigitalresponse.org"
                        },
-                       {
-                           name  = "VUE_APP_GRANTS_API_URL"
-                           value = "https://1ist1822ik.execute-api.us-west-2.amazonaws.com"
                        },
-                       {
-                           name  = "WEBSITE_DOMAIN"
-                           value = "https://grants.usdigitalresponse.org"
                        },
                    ]
-                   essential              = true
-                   image                  = "ghcr.io/usdigitalresponse/usdr-gost-api:stable"
-                   linuxParameters        = {
-                       capabilities       = {
-                           add  = []
-                           drop = []
                        }
-                       devices            = []
-                       initProcessEnabled = true
-                       tmpfs              = []
                    }
-                   logConfiguration       = {
-                       logDriver = "awslogs"
-                       options   = {
-                           awslogs-group         = "gost-prod-api-20230303023921715300000008"
-                           awslogs-region        = "us-west-2"
-                           awslogs-stream-prefix = "ecs"
                        }
                    }
-                   mountPoints            = [
-                       {
-                           containerPath = "/var/data"
-                           readOnly      = false
-                           sourceVolume  = "data"
                        },
                    ]
-                   name                   = "api"
-                   portMappings           = [
-                       {
-                           containerPort = 3000
-                           hostPort      = 3000
-                           protocol      = "tcp"
                        },
                    ]
-                   readonlyRootFilesystem = false
-                   secrets                = [
-                       {
-                           name      = "COOKIE_SECRET"
-                           valueFrom = "arn:aws:ssm:us-west-2:729134339726:parameter/gost/prod/api/cookie_secret"
                        },
-                       {
-                           name      = "POSTGRES_URL"
-                           valueFrom = "arn:aws:ssm:us-west-2:729134339726:parameter/gost/prod/postgres/connection_string"
                        },
                    ]
-                   volumesFrom            = []
                },
-               {
-                   cpu                    = 0
-                   environment            = [
-                       {
-                           name  = "DD_APM_ENABLED"
-                           value = "true"
                        },
-                       {
-                           name  = "ECS_FARGATE"
-                           value = "true"
                        },
                    ]
-                   essential              = false
-                   image                  = "public.ecr.aws/datadog/agent:latest"
-                   mountPoints            = []
-                   name                   = "datadog"
-                   portMappings           = []
-                   readonlyRootFilesystem = false
-                   secrets                = [
-                       {
-                           name      = "DD_API_KEY"
-                           valueFrom = "arn:aws:ssm:us-west-2:729134339726:parameter/gost/prod/datadog/api_key"
                        },
                    ]
-                   volumesFrom            = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "gost-prod-api" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
-       tags                     = {} -> null
      ~ tags_all                 = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (8 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-0b22d749517d906e0" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-05cdce2f27f5aab98" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-0b22d749517d906e0"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-05cdce2f27f5aab98"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.api.aws_iam_role.execution[0] will be updated in-place
  ~ resource "aws_iam_role" "execution" {
        id                    = "gost-prod-api-ECSTaskExecution-20230303023921815800000009"
        name                  = "gost-prod-api-ECSTaskExecution-20230303023921815800000009"
        tags                  = {}
      ~ tags_all              = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.api.aws_iam_role.task[0] will be updated in-place
  ~ resource "aws_iam_role" "task" {
      ~ assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Condition = {
-                           ArnLike      = {
-                               "aws:SourceArn" = "arn:aws:ecs:us-west-2:729134339726:*"
                            }
-                           StringEquals = {
-                               "aws:SourceAccount" = "729134339726"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gost-prod-api-ECSTask-2023030302392200850000000a"
        name                  = "gost-prod-api-ECSTask-2023030302392200850000000a"
        tags                  = {}
      ~ tags_all              = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (9 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_iam_role_policy.execution["decrypt-secrets"] will be updated in-place
  ~ resource "aws_iam_role_policy" "execution" {
        id     = "gost-prod-api-ECSTaskExecution-20230303023921815800000009:decrypt-secrets"
        name   = "decrypt-secrets"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "kms:Decrypt"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:kms:us-west-2:729134339726:key/1ad6df44-8096-465f-ae9e-6504c9c28171"
-                       Sid      = "DecryptWithKMS"
                    },
-                   {
-                       Action   = [
-                           "ssm:GetParameters",
-                           "secretsmanager:GetSecretValue",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:ssm:us-west-2:729134339726:parameter/gost/prod/postgres/connection_string",
-                           "arn:aws:ssm:us-west-2:729134339726:parameter/gost/prod/datadog/api_key",
-                           "arn:aws:ssm:us-west-2:729134339726:parameter/gost/prod/api/cookie_secret",
                        ]
-                       Sid      = "GetSecretParameters"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.api.aws_iam_role_policy.execution["write-api-logs"] will be updated in-place
  ~ resource "aws_iam_role_policy" "execution" {
        id     = "gost-prod-api-ECSTaskExecution-20230303023921815800000009:write-api-logs"
        name   = "write-api-logs"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "logs:PutLogEvents",
-                           "logs:DescribeLogStreams",
-                           "logs:CreateLogStream",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:logs:us-west-2:729134339726:log-group:gost-prod-api-20230303023921715300000008:log-stream:*",
-                           "arn:aws:logs:us-west-2:729134339726:log-group:gost-prod-api-20230303023921715300000008",
                        ]
-                       Sid      = "WriteLogs"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.api.aws_iam_role_policy.task["connect-to-postgres"] will be updated in-place
  ~ resource "aws_iam_role_policy" "task" {
        id     = "gost-prod-api-ECSTask-2023030302392200850000000a:connect-to-postgres"
        name   = "connect-to-postgres"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "rds-db:connect"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:us-west-2:729134339726:dbuser:cluster-36SARLZWML2BV46TW2KQUXXK6I/postgres"
-                       Sid      = "DBAccess"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.api.aws_iam_role_policy.task["ecs-exec"] will be updated in-place
  ~ resource "aws_iam_role_policy" "task" {
        id     = "gost-prod-api-ECSTask-2023030302392200850000000a:ecs-exec"
        name   = "ecs-exec"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "ssmmessages:OpenDataChannel",
-                           "ssmmessages:OpenControlChannel",
-                           "ssmmessages:CreateDataChannel",
-                           "ssmmessages:CreateControlChannel",
                        ]
-                       Effect   = "Allow"
-                       Resource = "*"
-                       Sid      = "AllowExec"
                    },
-                   {
-                       Action   = "logs:DescribeLogGroups"
-                       Effect   = "Allow"
-                       Resource = "*"
-                       Sid      = "InventoryLogGroupsForExec"
                    },
-                   {
-                       Action   = [
-                           "logs:PutLogEvents",
-                           "logs:DescribeLogStreams",
-                           "logs:CreateLogStream",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:logs:us-west-2:729134339726:log-group:gost-prod-api-20230303023921715300000008:log-stream:*"
-                       Sid      = "WriteExecLogs"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.api.aws_iam_role_policy.task["rw-arpa-audit-reports"] will be updated in-place
  ~ resource "aws_iam_role_policy" "task" {
        id     = "gost-prod-api-ECSTask-2023030302392200850000000a:rw-arpa-audit-reports"
        name   = "rw-arpa-audit-reports"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "s3:PutObject",
-                           "s3:GetObject",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:s3:::gost-prod-arpaauditreports-729134339726-us-west-2-api/*"
-                       Sid      = "ReadWriteBucketObjects"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.api.aws_iam_role_policy.task["send-emails"] will be updated in-place
  ~ resource "aws_iam_role_policy" "task" {
        id     = "gost-prod-api-ECSTask-2023030302392200850000000a:send-emails"
        name   = "send-emails"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = [
-                           "SES:SendRawEmail",
-                           "SES:SendEmail",
                        ]
-                       Condition = {
-                           StringLike = {
-                               "ses:FromAddress" = "grants-notifications@grants.usdigitalresponse.org"
                            }
                        }
-                       Effect    = "Allow"
-                       Resource  = "arn:aws:ses:us-west-2:729134339726:identity/grants.usdigitalresponse.org"
-                       Sid       = "SendEmails"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.api.aws_service_discovery_private_dns_namespace.default[0] will be updated in-place
  ~ resource "aws_service_discovery_private_dns_namespace" "default" {
        id          = "ns-tyq4inwptabi5mie"
        name        = "gost-prod.local"
        tags        = {}
      ~ tags_all    = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (4 unchanged attributes hidden)
    }

  # module.api.aws_service_discovery_service.default[0] will be updated in-place
  ~ resource "aws_service_discovery_service" "default" {
        id            = "srv-qoief7lzukracl4y"
        name          = "gost-prod-api"
        tags          = {}
      ~ tags_all      = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.api.aws_ssm_parameter.cookie_secret[0] will be updated in-place
  ~ resource "aws_ssm_parameter" "cookie_secret" {
        id              = "/gost/prod/api/cookie_secret"
      ~ key_id          = "arn:aws:kms:us-west-2:729134339726:key/1ad6df44-8096-465f-ae9e-6504c9c28171" -> (known after apply)
        name            = "/gost/prod/api/cookie_secret"
        tags            = {}
      ~ tags_all        = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (8 unchanged attributes hidden)
    }

  # module.api.aws_ssm_parameter.postgres_connection_string[0] will be updated in-place
  ~ resource "aws_ssm_parameter" "postgres_connection_string" {
        id              = "/gost/prod/postgres/connection_string"
      ~ key_id          = "arn:aws:kms:us-west-2:729134339726:key/1ad6df44-8096-465f-ae9e-6504c9c28171" -> (known after apply)
        name            = "/gost/prod/postgres/connection_string"
        tags            = {}
      ~ tags_all        = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (8 unchanged attributes hidden)
    }

  # module.api_to_postgres_security_group.aws_security_group.cbd[0] will be updated in-place
  ~ resource "aws_security_group" "cbd" {
        id                     = "sg-02a2851f809e91e7b"
        name                   = "gost-prod-api-postgres--QNiq-20230303023910133000000003"
        tags                   = {
            "Attributes" = "api-postgres"
            "Name"       = "gost-prod-api-postgres"
            "Namespace"  = "gost-prod"
        }
      ~ tags_all               = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postgres.aws_db_parameter_group.postgres13 will be updated in-place
  ~ resource "aws_db_parameter_group" "postgres13" {
        id          = "gost-prod-aurora-postgres13-db"
        name        = "gost-prod-aurora-postgres13-db"
        tags        = {}
      ~ tags_all    = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (3 unchanged attributes hidden)
    }

  # module.postgres.aws_rds_cluster_parameter_group.postgres13 will be updated in-place
  ~ resource "aws_rds_cluster_parameter_group" "postgres13" {
        id          = "gost-prod-aurora-postgres13-cluster"
        name        = "gost-prod-aurora-postgres13-cluster"
        tags        = {}
      ~ tags_all    = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (3 unchanged attributes hidden)

+       parameter {
+           apply_method = "immediate"
+           name         = "log_min_duration_statement"
+           value        = "-1"
        }
+       parameter {
+           apply_method = "immediate"
+           name         = "log_statement"
+           value        = "none"
        }
    }

  # module.website.aws_s3_object.deploy-config[0] will be updated in-place
  ~ resource "aws_s3_object" "deploy-config" {
        id                     = "/config/deploy-config.js"
        tags                   = {}
      ~ tags_all               = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.module.access_arpa_reports_bucket_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions       = (known after apply)
+           effect        = (known after apply)
+           not_actions   = (known after apply)
+           not_resources = (known after apply)
+           resources     = (known after apply)
+           sid           = (known after apply)

+           condition {
+               test     = (known after apply)
+               values   = (known after apply)
+               variable = (known after apply)
            }

+           not_principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }

+           principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }
        }
    }

  # module.api.module.api_gateway.aws_apigatewayv2_api.this[0] will be updated in-place
  ~ resource "aws_apigatewayv2_api" "this" {
        id                           = "1ist1822ik"
        name                         = "gost-prod"
        tags                         = {}
      ~ tags_all                     = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.api.module.api_gateway.aws_apigatewayv2_domain_name.this[0] will be updated in-place
  ~ resource "aws_apigatewayv2_domain_name" "this" {
        id                               = "api.grants.usdigitalresponse.org"
        tags                             = {}
      ~ tags_all                         = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.api.module.api_gateway.aws_apigatewayv2_stage.default[0] will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "default" {
        id              = "$default"
        name            = "$default"
        tags            = {}
      ~ tags_all        = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.api.module.api_gateway.aws_apigatewayv2_vpc_link.this["api-service"] will be updated in-place
  ~ resource "aws_apigatewayv2_vpc_link" "this" {
        id                 = "20s79e"
        name               = "gost-prod-api"
        tags               = {}
      ~ tags_all           = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (3 unchanged attributes hidden)
    }

  # module.api.module.arpa_audit_reports_bucket.data.aws_canonical_user_id.default[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_canonical_user_id" "default" {
+       display_name = (known after apply)
+       id           = (known after apply)
    }

  # module.api.module.arpa_audit_reports_bucket.data.aws_iam_policy_document.aggregated_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "aggregated_policy" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = [
+           (known after apply),
        ]
    }

  # module.api.module.arpa_audit_reports_bucket.data.aws_iam_policy_document.bucket_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
            ]
+           sid       = "DenyIncorrectEncryptionHeader"

+           condition {
+               test     = "StringNotEquals"
+               values   = [
+                   "AES256",
                ]
+               variable = "s3:x-amz-server-side-encryption"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
            ]
+           sid       = "DenyUnEncryptedObjectUploads"

+           condition {
+               test     = "Null"
+               values   = [
+                   "true",
                ]
+               variable = "s3:x-amz-server-side-encryption"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "ForceSSLOnlyAccess"

+           condition {
+               test     = "Bool"
+               values   = [
+                   "false",
                ]
+               variable = "aws:SecureTransport"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
    }

  # module.api.module.arpa_audit_reports_bucket.data.aws_partition.current[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
+       dns_suffix         = (known after apply)
+       id                 = (known after apply)
+       partition          = (known after apply)
+       reverse_dns_prefix = (known after apply)
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket.default[0] must be replaced
+/- resource "aws_s3_bucket" "default" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::gost-prod-arpaauditreports-729134339726-us-west-2-api" -> (known after apply)
      ~ bucket                      = "gost-prod-arpaauditreports-729134339726-us-west-2-api" -> (known after apply) # forces replacement
      ~ bucket_domain_name          = "gost-prod-arpaauditreports-729134339726-us-west-2-api.s3.amazonaws.com" -> (known after apply)
+       bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "gost-prod-arpaauditreports-729134339726-us-west-2-api.s3.us-west-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3BJ6K6RIION7M" -> (known after apply)
      ~ id                          = "gost-prod-arpaauditreports-729134339726-us-west-2-api" -> (known after apply)
      ~ policy                      = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "s3:PutObject"
-                       Condition = {
-                           StringNotEquals = {
-                               "s3:x-amz-server-side-encryption" = "AES256"
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = "*"
-                       Resource  = "arn:aws:s3:::gost-prod-arpaauditreports-729134339726-us-west-2-api/*"
-                       Sid       = "DenyIncorrectEncryptionHeader"
                    },
-                   {
-                       Action    = "s3:PutObject"
-                       Condition = {
-                           Null = {
-                               "s3:x-amz-server-side-encryption" = "true"
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = "*"
-                       Resource  = "arn:aws:s3:::gost-prod-arpaauditreports-729134339726-us-west-2-api/*"
-                       Sid       = "DenyUnEncryptedObjectUploads"
                    },
-                   {
-                       Action    = "s3:*"
-                       Condition = {
-                           Bool = {
-                               "aws:SecureTransport" = "false"
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = "*"
-                       Resource  = [
-                           "arn:aws:s3:::gost-prod-arpaauditreports-729134339726-us-west-2-api/*",
-                           "arn:aws:s3:::gost-prod-arpaauditreports-729134339726-us-west-2-api",
                        ]
-                       Sid       = "ForceSSLOnlyAccess"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "us-west-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
-           "Attributes" = "729134339726-us-west-2-api"
-           "Name"       = "gost-prod-arpaauditreports-729134339726-us-west-2-api"
-           "Namespace"  = "gost-prod"
        } -> (known after apply)
      ~ tags_all                    = {
-           "Attributes" = "729134339726-us-west-2-api" -> null
-           "Name"       = "gost-prod-arpaauditreports-729134339726-us-west-2-api" -> null
-           "Namespace"  = "gost-prod" -> null
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

+       cors_rule {
+           allowed_headers = (known after apply)
+           allowed_methods = (known after apply)
+           allowed_origins = (known after apply)
+           expose_headers  = (known after apply)
+           max_age_seconds = (known after apply)
        }

-       grant {
-           id          = "bae2af960b32b0cc8ed416f6c85c9ec0f06a0a192ccd67afede8eb5888070a7c" -> null
-           permissions = [
-               "FULL_CONTROL",
            ] -> null
-           type        = "CanonicalUser" -> null
        }
+       grant {
+           id          = (known after apply)
+           permissions = (known after apply)
+           type        = (known after apply)
+           uri         = (known after apply)
        }

      ~ lifecycle_rule {
          ~ abort_incomplete_multipart_upload_days = 1 -> (known after apply)
          ~ enabled                                = true -> (known after apply)
          ~ id                                     = "rule-1" -> (known after apply)
+           prefix                                 = (known after apply)
          ~ tags                                   = {} -> (known after apply)

          ~ expiration {
+               date                         = (known after apply)
              ~ days                         = 14 -> (known after apply)
              ~ expired_object_delete_marker = false -> (known after apply)
            }

+           noncurrent_version_expiration {
+               days = (known after apply)
            }

+           noncurrent_version_transition {
+               days          = (known after apply)
+               storage_class = (known after apply)
            }

+           transition {
+               date          = (known after apply)
+               days          = (known after apply)
+               storage_class = (known after apply)
            }
        }

+       logging {
+           target_bucket = (known after apply)
+           target_prefix = (known after apply)
        }

+       object_lock_configuration {
+           object_lock_enabled = (known after apply)

+           rule {
+               default_retention {
+                   days  = (known after apply)
+                   mode  = (known after apply)
+                   years = (known after apply)
                }
            }
        }

+       replication_configuration {
+           role = (known after apply)

+           rules {
+               delete_marker_replication_status = (known after apply)
+               id                               = (known after apply)
+               prefix                           = (known after apply)
+               priority                         = (known after apply)
+               status                           = (known after apply)

+               destination {
+                   account_id         = (known after apply)
+                   bucket             = (known after apply)
+                   replica_kms_key_id = (known after apply)
+                   storage_class      = (known after apply)

+                   access_control_translation {
+                       owner = (known after apply)
                    }

+                   metrics {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }

+                   replication_time {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }
                }

+               filter {
+                   prefix = (known after apply)
+                   tags   = (known after apply)
                }

+               source_selection_criteria {
+                   sse_kms_encrypted_objects {
+                       enabled = (known after apply)
                    }
                }
            }
        }

      ~ server_side_encryption_configuration {
          ~ rule {
              ~ bucket_key_enabled = false -> (known after apply)

              ~ apply_server_side_encryption_by_default {
+                   kms_master_key_id = (known after apply)
                  ~ sse_algorithm     = "AES256" -> (known after apply)
                }
            }
        }

      ~ versioning {
          ~ enabled    = true -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

+       website {
+           error_document           = (known after apply)
+           index_document           = (known after apply)
+           redirect_all_requests_to = (known after apply)
+           routing_rules            = (known after apply)
        }
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_acl.default[0] must be replaced
-/+ resource "aws_s3_bucket_acl" "default" {
      ~ bucket = "gost-prod-arpaauditreports-729134339726-us-west-2-api" -> (known after apply) # forces replacement
      ~ id     = "gost-prod-arpaauditreports-729134339726-us-west-2-api,private" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ access_control_policy {
-           grant {
-               permission = "FULL_CONTROL" -> null

-               grantee {
-                   display_name = "thendrickson+aws-grants-prod" -> null
-                   id           = "bae2af960b32b0cc8ed416f6c85c9ec0f06a0a192ccd67afede8eb5888070a7c" -> null
-                   type         = "CanonicalUser" -> null
                }
            }
+           grant {
+               permission = (known after apply)

+               grantee {
+                   display_name  = (known after apply)
+                   email_address = (known after apply)
+                   id            = (known after apply)
+                   type          = (known after apply)
+                   uri           = (known after apply)
                }
            }

          ~ owner {
              ~ display_name = "thendrickson+aws-grants-prod" -> (known after apply)
              ~ id           = "bae2af960b32b0cc8ed416f6c85c9ec0f06a0a192ccd67afede8eb5888070a7c" -> (known after apply)
            }
        }
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_lifecycle_configuration.default[0] must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "default" {
      ~ bucket = "gost-prod-arpaauditreports-729134339726-us-west-2-api" -> (known after apply) # forces replacement
      ~ id     = "gost-prod-arpaauditreports-729134339726-us-west-2-api" -> (known after apply)

      ~ rule {
            id     = "rule-1"
            # (1 unchanged attribute hidden)

          ~ expiration {
              ~ expired_object_delete_marker = false -> (known after apply)
                # (1 unchanged attribute hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_ownership_controls.default[0] must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "default" {
      ~ bucket = "gost-prod-arpaauditreports-729134339726-us-west-2-api" -> (known after apply) # forces replacement
      ~ id     = "gost-prod-arpaauditreports-729134339726-us-west-2-api" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_policy.default[0] must be replaced
-/+ resource "aws_s3_bucket_policy" "default" {
      ~ bucket = "gost-prod-arpaauditreports-729134339726-us-west-2-api" -> (known after apply) # forces replacement
      ~ id     = "gost-prod-arpaauditreports-729134339726-us-west-2-api" -> (known after apply)
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "s3:PutObject"
-                       Condition = {
-                           StringNotEquals = {
-                               "s3:x-amz-server-side-encryption" = [
-                                   "AES256",
                                ]
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = "*"
-                       Resource  = "arn:aws:s3:::gost-prod-arpaauditreports-729134339726-us-west-2-api/*"
-                       Sid       = "DenyIncorrectEncryptionHeader"
                    },
-                   {
-                       Action    = "s3:PutObject"
-                       Condition = {
-                           Null = {
-                               "s3:x-amz-server-side-encryption" = [
-                                   "true",
                                ]
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = "*"
-                       Resource  = "arn:aws:s3:::gost-prod-arpaauditreports-729134339726-us-west-2-api/*"
-                       Sid       = "DenyUnEncryptedObjectUploads"
                    },
-                   {
-                       Action    = "s3:*"
-                       Condition = {
-                           Bool = {
-                               "aws:SecureTransport" = [
-                                   "false",
                                ]
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = "*"
-                       Resource  = [
-                           "arn:aws:s3:::gost-prod-arpaauditreports-729134339726-us-west-2-api/*",
-                           "arn:aws:s3:::gost-prod-arpaauditreports-729134339726-us-west-2-api",
                        ]
-                       Sid       = "ForceSSLOnlyAccess"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_public_access_block.default[0] must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "default" {
      ~ bucket                  = "gost-prod-arpaauditreports-729134339726-us-west-2-api" -> (known after apply) # forces replacement
      ~ id                      = "gost-prod-arpaauditreports-729134339726-us-west-2-api" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_server_side_encryption_configuration.default[0] must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "default" {
      ~ bucket = "gost-prod-arpaauditreports-729134339726-us-west-2-api" -> (known after apply) # forces replacement
      ~ id     = "gost-prod-arpaauditreports-729134339726-us-west-2-api" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_versioning.default[0] must be replaced
-/+ resource "aws_s3_bucket_versioning" "default" {
      ~ bucket = "gost-prod-arpaauditreports-729134339726-us-west-2-api" -> (known after apply) # forces replacement
      ~ id     = "gost-prod-arpaauditreports-729134339726-us-west-2-api" -> (known after apply)

      ~ versioning_configuration {
+           mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.api.module.connect_to_postgres_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions   = [
+               "rds-db:connect",
            ]
+           effect    = "Allow"
+           resources = (sensitive value)
+           sid       = "DBAccess"
        }
    }

  # module.api.module.decrypt_secrets_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions       = (known after apply)
+           effect        = (known after apply)
+           not_actions   = (known after apply)
+           not_resources = (known after apply)
+           resources     = (known after apply)
+           sid           = (known after apply)

+           condition {
+               test     = (known after apply)
+               values   = (known after apply)
+               variable = (known after apply)
            }

+           not_principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }

+           principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }
        }
    }

  # module.api.module.ecs_exec_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions   = [
+               "ssmmessages:CreateControlChannel",
+               "ssmmessages:CreateDataChannel",
+               "ssmmessages:OpenControlChannel",
+               "ssmmessages:OpenDataChannel",
            ]
+           effect    = "Allow"
+           resources = [
+               "*",
            ]
+           sid       = "AllowExec"
        }
+       statement {
+           actions   = [
+               "logs:DescribeLogGroups",
            ]
+           effect    = "Allow"
+           resources = [
+               "*",
            ]
+           sid       = "InventoryLogGroupsForExec"
        }
+       statement {
+           actions   = [
+               "logs:CreateLogStream",
+               "logs:DescribeLogStreams",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:logs:us-west-2:729134339726:log-group:gost-prod-api-20230303023921715300000008:log-stream:*",
            ]
+           sid       = "WriteExecLogs"
        }
    }

  # module.api.module.efs_data_volume.aws_efs_access_point.default["data"] will be updated in-place
  ~ resource "aws_efs_access_point" "default" {
        id              = "fsap-05cdce2f27f5aab98"
        tags            = {
            "Name"      = "gost-prod-gost-prod-datavolume"
            "Namespace" = "gost-prod"
        }
      ~ tags_all        = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.api.module.efs_data_volume.aws_efs_file_system.default[0] will be updated in-place
  ~ resource "aws_efs_file_system" "default" {
        id                              = "fs-0b22d749517d906e0"
        tags                            = {
            "Name"      = "gost-prod-gost-prod-datavolume"
            "Namespace" = "gost-prod"
        }
      ~ tags_all                        = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.api.module.grants_scraper.data.aws_caller_identity.current[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
+       account_id = (known after apply)
+       arn        = (known after apply)
+       id         = (known after apply)
+       user_id    = (known after apply)
    }

  # module.api.module.grants_scraper.data.aws_iam_policy_document.permissions[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "permissions" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "ecs:RunTask",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowRunTask"

+           condition {
+               test     = "ArnLike"
+               values   = [
+                   (known after apply),
                ]
+               variable = "ecs:cluster"
            }
        }
+       statement {
+           actions   = [
+               "iam:PassRole",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:iam::729134339726:role/gost-prod-api-ECSTask-2023030302392200850000000a",
+               "arn:aws:iam::729134339726:role/gost-prod-api-ECSTaskExecution-20230303023921815800000009",
            ]
+           sid       = "AllowSchedulerPassRoleToExecutionRole"
        }
    }

  # module.api.module.grants_scraper.data.aws_iam_policy_document.trust[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "trust" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           effect  = "Allow"
+           sid     = "AssumeRole"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   (known after apply),
                ]
+               variable = "aws:SourceAccount"
            }

+           principals {
+               identifiers = [
+                   "scheduler.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.api.module.grants_scraper.aws_iam_role.default[0] will be updated in-place
  ~ resource "aws_iam_role" "default" {
      ~ assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Condition = {
-                           StringEquals = {
-                               "aws:SourceAccount" = "729134339726"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "scheduler.amazonaws.com"
                        }
-                       Sid       = "AssumeRole"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gost-prod-grants_scraper-2023030302392250420000000b"
        name                  = "gost-prod-grants_scraper-2023030302392250420000000b"
        tags                  = {}
      ~ tags_all              = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.api.module.grants_scraper.aws_iam_role_policy.default[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "default" {
        id     = "gost-prod-grants_scraper-2023030302392250420000000b:terraform-20230303024046969200000014"
        name   = "terraform-20230303024046969200000014"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "ecs:RunTask"
-                       Condition = {
-                           ArnLike = {
-                               "ecs:cluster" = "arn:aws:ecs:us-west-2:729134339726:cluster/gost-prod"
                            }
                        }
-                       Effect    = "Allow"
-                       Resource  = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api:*"
-                       Sid       = "AllowRunTask"
                    },
-                   {
-                       Action   = "iam:PassRole"
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:iam::729134339726:role/gost-prod-api-ECSTaskExecution-20230303023921815800000009",
-                           "arn:aws:iam::729134339726:role/gost-prod-api-ECSTask-2023030302392200850000000a",
                        ]
-                       Sid      = "AllowSchedulerPassRoleToExecutionRole"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.api.module.grants_scraper.aws_scheduler_schedule.default[0] will be updated in-place
  ~ resource "aws_scheduler_schedule" "default" {
        id                           = "default/gost-prod-grants_scraper-20230303024046967600000013"
        name                         = "gost-prod-grants_scraper-20230303024046967600000013"
        # (10 unchanged attributes hidden)

      ~ target {
          ~ arn      = "arn:aws:ecs:us-west-2:729134339726:cluster/gost-prod" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ ecs_parameters {
                tags                    = {}
              ~ task_definition_arn     = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api:4" -> (known after apply)
                # (8 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.api.module.http_security_group.aws_security_group.cbd[0] will be updated in-place
  ~ resource "aws_security_group" "cbd" {
        id                     = "sg-0aced72212cb31022"
        name                   = "gost-prod-api--jBYY-2023030302392315470000000e"
        tags                   = {
            "Attributes" = "api"
            "Name"       = "gost-prod-api"
            "Namespace"  = "gost-prod"
        }
      ~ tags_all               = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.api.module.send_emails_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions       = (known after apply)
+           effect        = (known after apply)
+           not_actions   = (known after apply)
+           not_resources = (known after apply)
+           resources     = (known after apply)
+           sid           = (known after apply)

+           condition {
+               test     = (known after apply)
+               values   = (known after apply)
+               variable = (known after apply)
            }

+           not_principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }

+           principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }
        }
    }

  # module.api.module.ssl_certificate.data.aws_route53_zone.default["grants.usdigitalresponse.org"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_route53_zone" "default" {
+       arn                        = (known after apply)
+       caller_reference           = (known after apply)
+       comment                    = (known after apply)
+       id                         = (known after apply)
+       linked_service_description = (known after apply)
+       linked_service_principal   = (known after apply)
+       name                       = (known after apply)
+       name_servers               = (known after apply)
+       primary_name_server        = (known after apply)
+       private_zone               = false
+       resource_record_set_count  = (known after apply)
+       tags                       = (known after apply)
+       vpc_id                     = (known after apply)
+       zone_id                    = (sensitive value)
    }

  # module.api.module.ssl_certificate.aws_acm_certificate.default[0] will be updated in-place
  ~ resource "aws_acm_certificate" "default" {
        id                        = "arn:aws:acm:us-west-2:729134339726:certificate/3294ab54-8721-4ace-8220-2d5f9166d26d"
        tags                      = {}
      ~ tags_all                  = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.api.module.ssl_certificate.aws_acm_certificate_validation.default[0] must be replaced
-/+ resource "aws_acm_certificate_validation" "default" {
      ~ id                      = "2023-03-03 02:39:45.963 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
-           "_5b177e2969e9a3154a5123ce999c7b23.api.grants.usdigitalresponse.org",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.api.module.ssl_certificate.aws_route53_record.default["api.grants.usdigitalresponse.org"] must be replaced
-/+ resource "aws_route53_record" "default" {
      ~ fqdn                             = "_5b177e2969e9a3154a5123ce999c7b23.api.grants.usdigitalresponse.org" -> (known after apply)
      ~ id                               = "Z03820991KN71D2RTTZNR__5b177e2969e9a3154a5123ce999c7b23.api.grants.usdigitalresponse.org._CNAME" -> (known after apply)
-       multivalue_answer_routing_policy = false -> null
        name                             = "_5b177e2969e9a3154a5123ce999c7b23.api.grants.usdigitalresponse.org"
      ~ zone_id                          = "Z03820991KN71D2RTTZNR" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.api.module.write_api_logs_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions   = [
+               "logs:CreateLogStream",
+               "logs:DescribeLogStreams",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:logs:us-west-2:729134339726:log-group:gost-prod-api-20230303023921715300000008",
+               "arn:aws:logs:us-west-2:729134339726:log-group:gost-prod-api-20230303023921715300000008:log-stream:*",
            ]
+           sid       = "WriteLogs"
        }
    }

  # module.postgres.module.db.aws_db_subnet_group.this[0] will be updated in-place
  ~ resource "aws_db_subnet_group" "this" {
        id                      = "gost-prod-postgres"
        name                    = "gost-prod-postgres"
        tags                    = {}
      ~ tags_all                = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (5 unchanged attributes hidden)
    }

  # module.postgres.module.db.aws_iam_role.rds_enhanced_monitoring[0] will be updated in-place
  ~ resource "aws_iam_role" "rds_enhanced_monitoring" {
        id                    = "gost-prod-db-monitoring--20230303023910132100000001"
        name                  = "gost-prod-db-monitoring--20230303023910132100000001"
        tags                  = {}
      ~ tags_all              = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (10 unchanged attributes hidden)
    }

  # module.postgres.module.db.aws_rds_cluster.this[0] will be updated in-place
  ~ resource "aws_rds_cluster" "this" {
        id                                  = "gost-prod-postgres-20230303023912395800000006"
        tags                                = {}
      ~ tags_all                            = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (44 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.postgres.module.db.aws_rds_cluster_instance.this["one"] will be updated in-place
  ~ resource "aws_rds_cluster_instance" "this" {
        id                                    = "gost-prod-postgres-one"
        tags                                  = {}
      ~ tags_all                              = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postgres.module.db.aws_security_group.this[0] will be updated in-place
  ~ resource "aws_security_group" "this" {
        id                     = "sg-0124e95c0312a83ce"
        name                   = "gost-prod-postgres-20230303023910139700000004"
        tags                   = {
            "Name" = "gost-prod-postgres"
        }
      ~ tags_all               = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.website.module.cdn.aws_cloudfront_distribution.this[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                             = "E2GZ8R86V6EG76"
        tags                           = {}
      ~ tags_all                       = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       web_acl_id                     = (known after apply)
        # (19 unchanged attributes hidden)

+       custom_error_response {
+           error_code         = 403
+           response_code      = 403
+           response_page_path = "/errors/403.html"
        }
+       custom_error_response {
+           error_code         = 404
+           response_code      = 404
+           response_page_path = "/errors/404.html"
        }

        # (7 unchanged blocks hidden)
    }

  # module.website.module.logs_bucket.data.aws_iam_policy_document.aggregated_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "aggregated_policy" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = [
+           (known after apply),
        ]
    }

  # module.website.module.logs_bucket.data.aws_iam_policy_document.bucket_policy[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "bucket_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           effect    = "Deny"
+           resources = [
+               "arn:aws:s3:::gost-prod-logs-729134339726-us-west-2-website/*",
            ]
+           sid       = "DenyIncorrectEncryptionHeader"

+           condition {
+               test     = "StringNotEquals"
+               values   = [
+                   "AES256",
                ]
+               variable = "s3:x-amz-server-side-encryption"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           effect    = "Deny"
+           resources = [
+               "arn:aws:s3:::gost-prod-logs-729134339726-us-west-2-website/*",
            ]
+           sid       = "DenyUnEncryptedObjectUploads"

+           condition {
+               test     = "Null"
+               values   = [
+                   "true",
                ]
+               variable = "s3:x-amz-server-side-encryption"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           effect    = "Deny"
+           resources = [
+               "arn:aws:s3:::gost-prod-logs-729134339726-us-west-2-website",
+               "arn:aws:s3:::gost-prod-logs-729134339726-us-west-2-website/*",
            ]
+           sid       = "ForceSSLOnlyAccess"

+           condition {
+               test     = "Bool"
+               values   = [
+                   "false",
                ]
+               variable = "aws:SecureTransport"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
    }

  # module.website.module.logs_bucket.aws_s3_bucket.default[0] will be updated in-place
  ~ resource "aws_s3_bucket" "default" {
        id                          = "gost-prod-logs-729134339726-us-west-2-website"
        tags                        = {
            "Attributes" = "729134339726-us-west-2-website"
            "Name"       = "gost-prod-logs-729134339726-us-west-2-website"
            "Namespace"  = "gost-prod"
        }
      ~ tags_all                    = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.website.module.logs_bucket.aws_s3_bucket_policy.default[0] will be updated in-place
  ~ resource "aws_s3_bucket_policy" "default" {
        id     = "gost-prod-logs-729134339726-us-west-2-website"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "s3:PutObject"
-                       Condition = {
-                           StringNotEquals = {
-                               "s3:x-amz-server-side-encryption" = [
-                                   "AES256",
                                ]
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = "*"
-                       Resource  = "arn:aws:s3:::gost-prod-logs-729134339726-us-west-2-website/*"
-                       Sid       = "DenyIncorrectEncryptionHeader"
                    },
-                   {
-                       Action    = "s3:PutObject"
-                       Condition = {
-                           Null = {
-                               "s3:x-amz-server-side-encryption" = [
-                                   "true",
                                ]
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = "*"
-                       Resource  = "arn:aws:s3:::gost-prod-logs-729134339726-us-west-2-website/*"
-                       Sid       = "DenyUnEncryptedObjectUploads"
                    },
-                   {
-                       Action    = "s3:*"
-                       Condition = {
-                           Bool = {
-                               "aws:SecureTransport" = [
-                                   "false",
                                ]
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = "*"
-                       Resource  = [
-                           "arn:aws:s3:::gost-prod-logs-729134339726-us-west-2-website/*",
-                           "arn:aws:s3:::gost-prod-logs-729134339726-us-west-2-website",
                        ]
-                       Sid       = "ForceSSLOnlyAccess"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.website.module.origin_bucket.data.aws_iam_policy_document.aggregated_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "aggregated_policy" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = [
+           jsonencode(
                {
+                   Statement = [
+                       {
+                           Action    = "s3:GetObject"
+                           Effect    = "Allow"
+                           Principal = {
+                               AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E35GY40GUTM4FN"
                            }
+                           Resource  = [
+                               "arn:aws:s3:::gost-prod-origin-729134339726-us-west-2-website/dist/*",
+                               "arn:aws:s3:::gost-prod-origin-729134339726-us-west-2-website/config/deploy-config.js",
                            ]
+                           Sid       = "S3GetObjectForCloudFront"
                        },
+                       {
+                           Action    = "s3:ListBucket"
+                           Effect    = "Allow"
+                           Principal = {
+                               AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E35GY40GUTM4FN"
                            }
+                           Resource  = "arn:aws:s3:::gost-prod-origin-729134339726-us-west-2-website"
+                           Sid       = "S3ListBucketForCloudFront"
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            ),
        ]
+       source_policy_documents   = [
+           (known after apply),
        ]
    }

  # module.website.module.origin_bucket.data.aws_iam_policy_document.bucket_policy[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "bucket_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           effect    = "Deny"
+           resources = [
+               "arn:aws:s3:::gost-prod-origin-729134339726-us-west-2-website/*",
            ]
+           sid       = "DenyIncorrectEncryptionHeader"

+           condition {
+               test     = "StringNotEquals"
+               values   = [
+                   "AES256",
                ]
+               variable = "s3:x-amz-server-side-encryption"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           effect    = "Deny"
+           resources = [
+               "arn:aws:s3:::gost-prod-origin-729134339726-us-west-2-website/*",
            ]
+           sid       = "DenyUnEncryptedObjectUploads"

+           condition {
+               test     = "Null"
+               values   = [
+                   "true",
                ]
+               variable = "s3:x-amz-server-side-encryption"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           effect    = "Deny"
+           resources = [
+               "arn:aws:s3:::gost-prod-origin-729134339726-us-west-2-website",
+               "arn:aws:s3:::gost-prod-origin-729134339726-us-west-2-website/*",
            ]
+           sid       = "ForceSSLOnlyAccess"

+           condition {
+               test     = "Bool"
+               values   = [
+                   "false",
                ]
+               variable = "aws:SecureTransport"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
    }

  # module.website.module.origin_bucket.aws_s3_bucket.default[0] will be updated in-place
  ~ resource "aws_s3_bucket" "default" {
        id                          = "gost-prod-origin-729134339726-us-west-2-website"
        tags                        = {
            "Attributes" = "729134339726-us-west-2-website"
            "Name"       = "gost-prod-origin-729134339726-us-west-2-website"
            "Namespace"  = "gost-prod"
        }
      ~ tags_all                    = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.website.module.origin_bucket.aws_s3_bucket_policy.default[0] will be updated in-place
  ~ resource "aws_s3_bucket_policy" "default" {
        id     = "gost-prod-origin-729134339726-us-west-2-website"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "s3:PutObject"
-                       Condition = {
-                           StringNotEquals = {
-                               "s3:x-amz-server-side-encryption" = [
-                                   "AES256",
                                ]
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = "*"
-                       Resource  = "arn:aws:s3:::gost-prod-origin-729134339726-us-west-2-website/*"
-                       Sid       = "DenyIncorrectEncryptionHeader"
                    },
-                   {
-                       Action    = "s3:PutObject"
-                       Condition = {
-                           Null = {
-                               "s3:x-amz-server-side-encryption" = [
-                                   "true",
                                ]
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = "*"
-                       Resource  = "arn:aws:s3:::gost-prod-origin-729134339726-us-west-2-website/*"
-                       Sid       = "DenyUnEncryptedObjectUploads"
                    },
-                   {
-                       Action    = "s3:*"
-                       Condition = {
-                           Bool = {
-                               "aws:SecureTransport" = [
-                                   "false",
                                ]
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = "*"
-                       Resource  = [
-                           "arn:aws:s3:::gost-prod-origin-729134339726-us-west-2-website/*",
-                           "arn:aws:s3:::gost-prod-origin-729134339726-us-west-2-website",
                        ]
-                       Sid       = "ForceSSLOnlyAccess"
                    },
-                   {
-                       Action    = "s3:GetObject"
-                       Effect    = "Allow"
-                       Principal = {
-                           AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E35GY40GUTM4FN"
                        }
-                       Resource  = [
-                           "arn:aws:s3:::gost-prod-origin-729134339726-us-west-2-website/dist/*",
-                           "arn:aws:s3:::gost-prod-origin-729134339726-us-west-2-website/config/deploy-config.js",
                        ]
-                       Sid       = "S3GetObjectForCloudFront"
                    },
-                   {
-                       Action    = "s3:ListBucket"
-                       Effect    = "Allow"
-                       Principal = {
-                           AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E35GY40GUTM4FN"
                        }
-                       Resource  = "arn:aws:s3:::gost-prod-origin-729134339726-us-west-2-website"
-                       Sid       = "S3ListBucketForCloudFront"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.website.module.waf.aws_wafv2_web_acl.default[0] will be created
+   resource "aws_wafv2_web_acl" "default" {
+       arn         = (known after apply)
+       capacity    = (known after apply)
+       description = "Managed by Terraform"
+       id          = (known after apply)
+       lock_token  = (known after apply)
+       name        = "gost-prod"
+       scope       = "CLOUDFRONT"
+       tags        = {
+           "Name"      = "gost-prod"
+           "Namespace" = "gost-prod"
        }
+       tags_all    = {
+           "Name"      = "gost-prod"
+           "Namespace" = "gost-prod"
        }

+       default_action {
+           allow {
            }
        }

+       visibility_config {
+           cloudwatch_metrics_enabled = true
+           metric_name                = "gost-prod"
+           sampled_requests_enabled   = true
        }
    }

  # module.api.module.efs_data_volume.module.security_group.aws_security_group.cbd[0] will be updated in-place
  ~ resource "aws_security_group" "cbd" {
        id                     = "sg-0ce0913bf308258c4"
        name                   = "gost-prod-gost-prod-datavolume-20230403112714974000000001"
        tags                   = {
            "Name"      = "gost-prod-gost-prod-datavolume"
            "Namespace" = "gost-prod"
        }
      ~ tags_all               = {
+           "env"        = "production"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 12 to add, 45 to change, 11 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request`, Workflow: `Terraform CI`*